app/controllers/api/v1/stored_payloads_controller.rb

INSERT INTO "stored_payloads" ("payload_json", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["payload_json", "{\"z\":true}"], ["created_at", "2026-04-28 07:50:58.153282"], ["updated_at", "2026-04-28 07:50:58.153282"]]
---
      def create
        unless json_content_type?
          return render_error(
            code: "UNSUPPORTED_MEDIA_TYPE",
            message: "Use Content-Type: application/json for this endpoint.",
            status: 415,
            hint: "Example: curl -H \"Content-Type: application/json\" -d '{\"a\":1}' ..."
          )
        end

        parsed = StoredPayloadStore.decode_raw_body!(request.raw_post.to_s)
        norm = safe_as_json(parsed)

        record = StoredPayload.create!(payload_json: norm)

SELECT "stored_payloads".* FROM "stored_payloads" WHERE "stored_payloads"."id" = ? LIMIT ?  [["id", 99999], ["LIMIT", 1]]
---
      def show
        idx = validate_index_param(params[:index])
        return if idx.nil?

        record = StoredPayload.find_by(id: idx)

SELECT MAX("stored_payloads"."id") FROM "stored_payloads"
---
      def latest_index
        render_success(data: { latest_index: StoredPayload.maximum(:id) })