app/jobs/stored_payload_purge_job.rb

DELETE FROM "stored_payloads"
---
  def perform
    n = StoredPayload.delete_all